In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4])
type(s)
s1=pd.Series([1,2,3,4], index=['A','B','C','D'])

In [3]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [6]:
data = [[1,44,'abc'],
        [2,555,'def'],
        [3,666,'jrt'],
        [4,777,'asj']
        ]
df=pd.DataFrame(data,columns=['Id','std_ID','Dept'])
display(df)

   Id  std_ID Dept
0   1      44  abc
1   2     555  def
2   3     666  jrt
3   4     777  asj

In [7]:
df.columns

Index(['Id', 'std_ID', 'Dept'], dtype='str')

In [ ]:
index= ['row1','row2','row3','row4']
df.index=index
display(df)

      Id  std_ID Dept
row1   1      44  abc
row2   2     555  def
row3   3     666  jrt
row4   4     777  asj

In [10]:
df.dtypes

Id        int64
std_ID    int64
Dept        str
dtype: object

In [11]:
df['Dept'].dtype

In [12]:
df['Dept'] = df['Dept'].astype('category')

In [13]:
df['Dept'].dtype

CategoricalDtype(categories=['abc', 'asj', 'def', 'jrt'], ordered=False, categories_dtype=str)

In [14]:
df.dtypes

Id           int64
std_ID       int64
Dept      category
dtype: object

In [15]:
df.tail(2)

      Id  std_ID Dept
row3   3     666  jrt
row4   4     777  asj

In [16]:
df.describe()

             Id      std_ID
count  4.000000    4.000000
mean   2.500000  510.500000
std    1.290994  323.936722
min    1.000000   44.000000
25%    1.750000  427.250000
50%    2.500000  610.500000
75%    3.250000  693.750000
max    4.000000  777.000000

In [17]:
df.describe(include='category')

       Dept
count     4
unique    4
top     abc
freq      1

In [18]:
df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='str')

In [24]:
x=df['std_ID'].unique().sum()
x

np.int64(2042)

In [25]:
df.Dept.idxmin()

'row1'

In [26]:
df.info()

<class 'pandas.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      4 non-null      int64
 1   std_ID  4 non-null      int64
 2   Dept    4 non-null      category
dtypes: category(1), int64(2)
memory usage: 476.0+ bytes